{  
  "allMissions":
    [
      {
    "missionName": "Wild and Dangerous",
    "location": "The Castle",
    "minAge": 0,
    "maxAge": 100,
    "description": "You take Darth to a small room in which there is an adolescent Cardosian lion. A gift from a darrow root merchant you buy from. You tell your apprentice they are to remain in the room for 1 hour, at which point you will return and unlock the door.",
    "passReqs": "Power 20\nConfidence 10",
    "succeed": "Confidence 10\nPower 5",
    "fail": "Power -5\nAddAttribute ResentsNature",
    "successText": "When you return you find Darth fast asleep on the stomach of the lion. When they wake up they tell you the've named it \"Paul\".",
    "failureText": "When you return you find Darth and the lion in opposite corners of the room, staring at one another. Your apprentice has bled on the floor and you can see from their arms whence it came. Your apprentice immediately leaves the room telling you they hate lions almost as much as lions hate them.",
    "previousMission": "None",
    "previousMissionResultNeeded": "None"
  },
  {
    "missionName": "A Test",
    "location": "The Castle",
    "minAge": 0,
    "maxAge": 100,
    "description": "You bring Paul the Cardosian lion out onto the veranda where your apprentice is watching the stars. You tell them that to prove their loyalty to you they must kill the animal. Now.",
    "passReqs": "Loyalty 60",
    "succeed": "Power 5\nAddAttribute Depressed",
    "fail": "Loyalty -10",
    "successText": "You see their shoulders tense as they turn to you, their face a mask of placid calm. While maintaining eye contact with you they reach out their hand and Paul goes to them. As the lion approaches, your apprentice summons two blades of light from their fingertips and plunges them into the face of the creature which falls dead immediately.",
    "failureText": "Their shoulders tense. \"Why do you ask this of me?\"\n\"Because,\" you say, \"we are often required to sacrifice that which we love most in our pursuits. I must know if you are capable of such a sacrifice.\"\n\"I refuse to waste life for no reason,\" they reply. An instant later and you've killed the lion with a deft stroke of crimson light. You turn to Darth, \"Pity, then, that you should waste a life to rebuke me. Now clean this up.",
    "previousMission": "Wild and Dangerous",
    "previousMissionResultNeeded": "Success"
  },
  {
    "missionName": "Seek and Find",
    "location": "The Castle",
    "minAge": 0,
    "maxAge": 5,
    "description": "You sit your young apprentice down in a parapet far from the main hall. You give them five minutes to make it back to the hall. If they make it in time, they will receive a special treat, if not, well...they'd rather not find out now would they?",
    "passReqs": "Skill - 5\nConfidence - 10",
    "succeed": "Confidence 5",
    "fail": "Confidence -5",
    "successText": "You teleport yourself back to the main hall, and before you can resume your place at the table to finish your morning meal of darkness you hear the pitter-patter of feet from the far entrance. \"Ah, very good, very good indeed. Please join me at the table young apprentice, I've prepared your favorite meal.\" You notice them suppress a smile as they shuffle over and take their seat.",
    "failureText": "You teleport back to the main hall and resume your morning meal. It's not until the late afternoon that you see Darth again, covered in dust and cobwebs. They look to be on the verge of tears. \"Well, it seems like you've discovered your punishment. Come now, and clean yourself up.",
    "previousMission": "None",
    "previousMissionResultNeeded": "None"
  },
  {
    "missionName": "The Children's Gauntlet",
    "location": "The Castle",
    "minAge": 0,
    "maxAge": 5,
    "description": "In the castle basement is a series of obstacles, puzzles and traps designed by the best Kugrew engineers in the galaxy. The Kugrew's diminutive size makes them perfect for constructing a gauntlet for young pupils.",
    "passReqs": "Skill - 7\nPower - 20",
    "succeed": "Skill 10",
    "fail": "Confidence -5\nLoyalty -3",
    "successText": "You set young Darth down in front of the gauntlet and give them a small push. Their eyes go wide as they approach the first obstacle but they quickly scramble over it and scurry in a blur through the rest of the traps and puzzles.",
    "failureText": "You set your young apprentice in front of the gauntlet and give them a small push. The first obstacle crashes down in front of them and they turn around screaming to scurry behind you.",
    "previousMission": "None",
    "previousMissionResultNeeded": "None"
  },
  {
    "missionName": "Treats and Talismans",
    "location": "The Castle",
    "minAge": 0,
    "maxAge": 5,
    "description": "You find a dusty copy of game from your youth in the castle basement, \"Treats and Talismans\". If memory serves it proved to help shape your own strategic thinking as a youth, but also spurred more than a handful of tantrums.",
    "passReqs": "Skill - 10\nLoyalty - 60",
    "succeed": "Confidence 3\nSkill 3",
    "fail": "Confidence -3\nLoyalty -2",
    "successText": "Come now, sit with me and play a game,\" you say to your apprentice. Several hours later and you realize you've played half a dozen games with the young one and while they've yet to win, they remain committed to the task at hand with their brow deeply furrowed. It all but brings a smile to your face.",
    "failureText": "At the end of the first game as your Emperor Talisman devours the last treat Darth flies into a blind rage, flipping the table and scattering the pieces. They are not the only one to be disappointed by the afternoon's outcome.",
    "previousMission": "None",
    "previousMissionResultNeeded": "None"
  },
  {
    "missionName": "Bend the Light",
    "location": "The Castle",
    "minAge": 0,
    "maxAge": 5,
    "description": "Today's the day. Their first lesson in harnessing the power of light and dark. While they are quite young, the earlier they begin their training the better.",
    "passReqs": "Power - 20",
    "succeed": "Confidence 5\nSkill 3\nPower 2",
    "fail": "Confidence -4",
    "successText": "You guide them through the stances, utterances, and gestures needed to summon light and bend it to your will. They are attentive, and display a surprising amount of power for someone their age. A most promising apprentice indeed.",
    "failureText": "You began at dawn and the sun has now set. Darth has failed to summon even a spark of light and is clearly becoming frustrated. Perhaps they are not as powerful as you had hoped.",
    "previousMission": "None",
    "previousMissionResultNeeded": "None"
  },
  {
    "missionName": "Harvest",
    "location": "Castle Apothecary",
    "minAge": 0,
    "maxAge": 5,
    "description": "Darth has yet to be of much practical help around the castle. Perhaps they can use their small hands to extract the adrenal glands of logron newts for use in your many potions.",
    "passReqs": "Confidence 15",
    "succeed": "Loyalty 4",
    "fail": "Skill -3",
    "successText": "Darth isn't so sure about this whole dissection thing, but comes around when you let them use your forefinger from which a stout blade of life protrudes as a scalpel.",
    "failureText": "As they make their first incision into the small pearlescent amphibian Darth winces, drops their knife, and begins vomiting.",
    "previousMission": "None",
    "previousMissionResultNeeded": "None"
  },
  {
    "missionName": "Flame in Hand",
    "location": "Castle Sublevel",
    "minAge": 0,
    "maxAge": 5,
    "description": "The castle is powered from an eternal flame stolen from the heart of a cursed star. It makes a particularly good cup of tea as well, but is not hot to the touch despite its fiery appearance. Ask Darth to touch it and see what happens.",
    "passReqs": "Loyalty 70",
    "succeed": "Skill 3",
    "fail": "Power -4",
    "successText": "Your small apprentice looks at the furnace in which the cursed heart yet burns.\n\"Is hot?\" they ask, the fire reflected in their eyes.\n\"No, my Darth, you may trust me.\" And they do.",
    "failureText": "Darth pouts and refuses to go near the flame. You instruct them once more to plunge their hand into the fire, even showing them how it's done has no effect. You leave them locked in there the rest of the night, despite their cries.",
    "previousMission": "None",
    "previousMissionResultNeeded": "None"
  },
  {
    "missionName": "Ghosts and Gandrays",
    "location": "The Castle",
    "minAge": 6,
    "maxAge": 11,
    "description": "Darth has been asking Big Questions recently about life, death, and what happens when the latter takes you. Perhaps it's time to tell them about the incorporeal guests of the castle. However they may not take such news well.",
    "passReqs": "Confidence - 13\nPower - 15",
    "succeed": "Loyalty 7\nAddAttribute Suggestable",
    "fail": "Power -5\nSubAttribute Spiritual",
    "successText": "You tell Darth that the castle is haunted by the ghosts of former apprentices (and for all you know, it is). If they act out, they will be gobbled up by the Gandray in the basement and condemned to a similar fate! Darth believes every word.",
    "failureText": "You tell Darth that the castle is haunted by the ghosts of failed apprentices. They don't believe you, and decide that such supernatural beings cannot exist.",
    "previousMission": "None",
    "previousMissionResultNeeded": "None"
  },
  {
    "missionName": "Blood on the Path to Talacan",
    "location": "Outer Rim Waystation",
    "minAge": 6,
    "maxAge": 11,
    "description": "While refueling on your way to Talacan, you and Darth witness a robbery in which the aggrieved party is stabbed. The thief is slinking through a narrow corridor, and Darth wants to run them down to enact \"justice.\" You tell them there is no such thing and to keep their nose out of others' wrongdoings.",
    "passReqs": "BadAttribute - Temperamental\nPower - 17\nLoyalty - 70",
    "succeed": "Loyalty 5",
    "fail": "Power -6\nSubAttribute Aloof",
    "successText": "Darth sighs and does nothing. Moments later and the station's security arrive with a supersonic clap in pursuit of the thief.",
    "failureText": "Darth tries to stay put, but cannot. They break for the corridor as you stand watching. As Darth passes the body, however, the station's security arrive with a supersonic clap. Alas, things are about to get much more gruesome...",
    "previousMission": "None",
    "previousMissionResultNeeded": "None"
  },
  {
    "missionName": "Phone a Fiend",
    "location": "Castle Grounds",
    "minAge": 6,
    "maxAge": 11,
    "description": "Young Darth has been sulking more than usual recently. Perhaps they could use a friend? Take Darth out to the Castle Grounds and show them how to summon their own disciple.",
    "passReqs": "Power - 20\nConfidence - 15\nBadAttribute - Impatient",
    "succeed": "Power 5\nSubAttribute Depressed",
    "fail": "Confidence -5\nLoyalty -3",
    "successText": "Darth's shadow stretches long in the moonlight. With incense burning and candles lit, they begin the incantation. In mere moments, there is a loud snapping sound and the smell of sulfur. A Hymthonian ogre stands before the two of you, snarling.",
    "failureText": "In the dark of night you take Darth to the castle grounds. After performing the ritual yourself, you begin instructing your apprentice. But Darth is impatient, and rushes through the incantation. They summon a quivering mess of entrails and eyeballs. Perhaps it was something fierce once, you think as you incinerate it, but it is now just another symbol of failure.",
    "previousMission": "None",
    "previousMissionResultNeeded": "None"
  },
  {
    "missionName": "Catch with No Hands",
    "location": "The Castle",
    "minAge": 6,
    "maxAge": 11,
    "description": "The day is long and the weather is about as nice as it gets around the castle. Why not a game of catching light?",
    "passReqs": "Skill - 10",
    "succeed": "Power 2\nLoyalty 4",
    "fail": "Skill -2\nLoyalty -3",
    "successText": "Darth shows a knack for catching the ball of light you throw to them, even if you \"accidentally\" throw it quite far from them. The pleasure the get from the game is impossible to ignore.",
    "failureText": "You weren't expecting much from them, but they've somehow managed to be worse at this than you thought possible. The game doesn't last long as they seem totally incapable of catching even the slowest pass you can muster.",
    "previousMission": "None",
    "previousMissionResultNeeded": "None"
  },
  {
    "missionName": "The Gauntlet for Growing Disciples",
    "location": "Castle Orbit",
    "minAge": 6,
    "maxAge": 11,
    "description": "A larger and more menacing affair than the Children's Gauntlet, this obstacle course was designed to be brutal, even cruel. But your apprentice is ready for such a trial, are they not?",
    "passReqs": "Skill - 15",
    "succeed": "Skill 3\nConfidence 3\nLoyalty 2",
    "fail": "Confidence -2\nLoyalty -3",
    "successText": "Darth stands for a moment in front of the gauntlet, eyes closed. When they begin to walk towards the swinging blades of the first obstacle you see a thin tendril of light whisking the air in front of them. As they meet the obstacle the light splays and they begin to navigate easily around the various traps and pitfalls that await them, without even opening an eye.",
    "failureText": "Darth stands nervously in front of the Gauntlet. You sense their nerves and watch as their eyes follow the swinging blades of the first obstacle. They take one shaky step and you stop them. \"Do not be a fool,\" you say, \"this gauntlet will indeed kill you. You are not ready. Perhaps you never will be.",
    "previousMission": "None",
    "previousMissionResultNeeded": "None"
  },
  {
    "missionName": "Wilderness Survival",
    "location": "Castle Grounds",
    "minAge": 6,
    "maxAge": 11,
    "description": "You wake Darth early in the morning. \"Come,\" you say opening the blinds in their room. \"We are leaving. Meet me in the shuttle in one hour.\" You take off from the castle and fly deep into the outer wilderness that surrounds it. After an hour of subsonic flight, you land, give Darth a pack, send them from the shuttle, and tell them to return to the castle as soon as they can. And then you leave.",
    "passReqs": "Loyalty - 60\nConfidence - 10",
    "succeed": "Loyalty 3\nConfidence 3\nSkill 3",
    "fail": "Confidence -3\nLoyalty -2",
    "successText": "The following afternoon Darth returns. They're filthy, but otherwise appear unharmed. \"Very good, Darth. How was your adventure?\"\n\"Excellent, master. Next time I wish you'd join me.",
    "failureText": "After two days go by you send out a pack of scouting droids to find Darth. An hour later and they return, the data shows Darth did not move very far from the place you left them. When you ask them what happened it's all they can do to keep from crying. \"Pathetic, return to your chambers and clean yourself up.",
    "previousMission": "None",
    "previousMissionResultNeeded": "None"
  },
  {
    "missionName": "Market Caper",
    "location": "Yungo Market",
    "minAge": 6,
    "maxAge": 11,
    "description": "You take Darth to Yungo Market so that they might take in the sights, sounds, and habits of its denizens. Once deep among the hundreds of stalls you turn to Darth and point to an embellished semi-conductor being offered nearby. \"Take that bauble, my apprentice, but do not dare to be caught, for I will not defend you here.",
    "passReqs": "Skill - 15\nConfidence - 10\nLoyalty - 50",
    "succeed": "Power 3",
    "fail": "Confidence -2\nPower -3",
    "successText": "You return to the shuttle watching the sensors and image feeds coming in from the satellite you have positioned above. Somehow it loses trace of Darth, and as you move to recalibate it you hear their footsteps on the shuttle ramp. \"I got the conductor you asked for,\" Darth tosses you the trinket, \"and I thought you might like these as well.\" They open their cloak to reveal several long, slender vials of murky liquid that you know all too well: Vacuum potions. \"Well done, Darth, well done indeed. However, those potions will be missed,\" the scanner begins to beep, \"We should go. Now.",
    "failureText": "You return to the shuttle watching the sensors and image feeds coming in from the satellite you have positioned above. You see dust being kicked up in the middle of the market and several flashes of light tinged red with what you hope is jacura juice. A few moments later and Darth stumbles aboard the shuttle with shouting merchants close behind and blood dripping from their tunic. So it wasn't jacura then. You launch the shuttle without asking any questions. Another disappointment.",
    "previousMission": "None",
    "previousMissionResultNeeded": "None"
  },
  {
    "missionName": "Torture Illuminated",
    "location": "The Castle",
    "minAge": 6,
    "maxAge": 11,
    "description": "Only the sick and twisted enjoy torture, but alas it is very useful in a variety of scenarios. Thus, it is best to know what one is doing when one begins to poke and prod, lest they kill a useful asset prematurely. Instruct Darth in the ways of torture and they will begin to understand how the galaxy really works.",
    "passReqs": "Loyalty - 80\nConfidence - 15\nPower - 30",
    "succeed": "Power 5\nLoyalty 3",
    "fail": "Loyalty -5\nConfidence -5",
    "successText": "You being with a no-name banker from outer rim. An easy enough target from which one might extract a secret or two. Darth shows a knack for the craft of torture and has the man singing the codes to every account he can think of within the hour. After cycling in a few more such subjects you realize this side of Darth is unlike any you've seen before. Good. Yes, very good.",
    "failureText": "Vomit and blood stain the chamber floor and you leave in disgust. No sooner had Darth begun to work than they tossed up what food they had in their stomach. While it's unwise to eat before torture, Darth should nevertheless be capable of more evil without upsetting their own anatomy.",
    "previousMission": "None",
    "previousMissionResultNeeded": "None"
  },
  {
    "missionName": "A Contender",
    "location": "The Castle",
    "minAge": 12,
    "maxAge": 17,
    "description": "A missive appears on your holodesk from an old friend. They've recently taken on an apprentice of their own and would like to challenge Darth to a duel. That they know of your apprentice is of some concern, and it could perhaps be prudent for this duel to end in the demise of their own.",
    "passReqs": "Power - 40\nConfidence - 20\nSkill - 20",
    "succeed": "Power 10\nConfidence 5",
    "fail": "Confidence -5\nPower -3",
    "successText": "You agree to the duel and prepare Darth accordingly. A week later and it is held on a neutral asteroid arena. The fight is brief but brutal. In the end, Darth stands above the body of the contender, a radiant shaft of light protrudes from their throat. Your acquaintance does not seem pleased, but respects the result.",
    "failureText": "You agree to the duel and prepare Darth accordingly. They are nervous and almost seem to ask that you call the whole thing off. A week later and the duel is held on a neutral asteroid arena. The fight is brief but brutal. Darth hardly had time to put up a lightwall shield before their opponent smashed them to the ground with pure radiant energy. Darth survives the attack, but their ego may never recover.",
    "previousMission": "None",
    "previousMissionResultNeeded": "None"
  },
  {
    "missionName": "Stranded",
    "location": "Castle Moon",
    "minAge": 12,
    "maxAge": 17,
    "description": "You summon Darth to the shuttle and fly off-world to Castle Moon–a large, dark rock heavy with sulfur and flashes of gaseous neon. This time you've warned Darth ahead of time to pack for travel, but do not tell them your plan to leave them stranded on the moon with only a broken down shuttle as a means of return.",
    "passReqs": "Loyalty - 50\nSkill - 25",
    "succeed": "Confidence 5\nSkill 3",
    "fail": "Loyalty -3",
    "successText": "Exactly 48 hours later Darth returns, but they're not in the old shuttle you left them. Instead they walk calmly out of a gleaming Rudino-8 lite transport. They tell you they were able to hail a group of travelers with the shuttles comms, and swiftly dispatched with the Rudiono's owners to claim it as their own. You allow yourself a toothy grin and congratulate Darth on the new ship.",
    "failureText": "A few days later and you receive an alert that there is a foreign object hurtling towards the castle. The auto-shield activates and you ensure that the object is captured and brought to the castle landing field. Darth sumbles out of the charred machine–their hands covered in burns. \"You would have died were it not for the shuttle-catchers.\"\n\"The what?\" Darth asks.\n\"And you didn't even anticipate them, did you?\"\n\"But I was able to get the shuttle to–\"\n\"You failed, Darth. You're lucky to be alive.",
    "previousMission": "None",
    "previousMissionResultNeeded": "None"
  },
  {
    "missionName": "A Debate",
    "location": "The Castle",
    "minAge": 12,
    "maxAge": 17,
    "description": "While Darth's training is going well enough, you feel their intellect is lacking. Perhaps a debate is in order...yes. With an Ieloron. One of their kind should be easy enough to procure for an afternoon.",
    "passReqs": "Skill - 35",
    "succeed": "Skill 5\nConfidence 3",
    "fail": "Skill -3",
    "successText": "The Ieloron manifests for a few hours at your behest and debates Darth on a range of topics from the best uses of darrow root to the implications of using a vacuum potion in a crowded market. Darth's verbal sparring skills are up to par, and the spectral mind dispels itself in satisfaction.",
    "failureText": "The Ieloron manifests at your behest and debates Darth on a range of topics from the best uses of darrow root to the implications of using a vacuum potion in a crowded market. Darth stumbles over every phrase and on several occasions has naught to say to the spectral mind floating before them. It's all you can do to prevent the Ieloron from devouring Darth before you dispel the creature.",
    "previousMission": "None",
    "previousMissionResultNeeded": "None"
  },
  {
    "missionName": "Hunt",
    "location": "Cardosian Wilderness",
    "minAge": 12,
    "maxAge": 17,
    "description": "It occurs to you one afternoon that it's just the right season for a Cardosian hunt, and it's been far too long since you last tasted fresh gorung. Procuring the rare melon from the depths of the Cardosian wilderness will indeed be a suitable challenge for Darth.",
    "passReqs": "Power - 35\nLoyalty - 50",
    "succeed": "Loyalty 4\nPower 3",
    "fail": "Loyalty -4",
    "successText": "The trip is a success and after only a few days, Darth returns to the remote outpost villa you've taken with a sack full of gorung melons. There is a brief moment you have while feasting on the blue flesh in which you feel a fondness for your apprentice. You hope they were unable to sense it.",
    "failureText": "The two of you successfully take a villa in the Cardosian wilderness, but that is the extent of the trip's redeeming qualities. Darth is completely unable to locate any gorung fruit, and after a few days returns in the evening limping. A Cardosian lion got the better of them and it was all they could do to make it back alive.",
    "previousMission": "None",
    "previousMissionResultNeeded": "None"
  },
  {
    "missionName": "Punishment",
    "location": "The Castle",
    "minAge": 12,
    "maxAge": 17,
    "description": "You realize with some shock that Darth has yet to kill someone in cold blood, and that should change. You summon them to your chambers where you grab a soul at random from the cosmos. Ah, it's a middle-aged Yardosian. They won't be missed. You instruct Darth to kill them. Now.",
    "passReqs": "Loyalty - 70",
    "succeed": "Loyalty 3\nPower 3",
    "fail": "Loyalty -5\nConfidence -3",
    "successText": "Darth does as their told with little hesitation and great panache, decapitating the confused and trembling Yardosian with a flick of their wrist and an orange blade of dull hatred.",
    "failureText": "Darth hesitates, and as they prevaricate the Yardosian begins to realize what's happening. Their shrill cries grate on your ears and you're forced to restrain them with binding light to the floor. You look at Darth, \"Do it,\" you say, but they do not move. With great disappointment you summon another restraining band around the Yardosian's throat and end them with a swift yank. What a waste.",
    "previousMission": "None",
    "previousMissionResultNeeded": "None"
  },
  {
    "missionName": "An Assault",
    "location": "The Castle",
    "minAge": 12,
    "maxAge": 17,
    "description": "A dull week is coming to an end when an idea strikes you. In the small hours of the morning you flip on all of the castle's defensive measures. Alarms immediately begin to ring and you yell at Darth over the intercom to their room that the castle is under siege. Their reaction should prove illustrative.",
    "passReqs": "Loyalty - 60\nConfidence - 10",
    "succeed": "Loyalty 3\nConfidence 3",
    "fail": "Confidence -3",
    "successText": "Moments later Darth enters the command room in their combat gear. They calmly approach the center console and examine the alert feed, then turn to you perplexed. \"Whence does the threat come, master?\"\n\"There is no threat, my apprentice, but your reaction this morning reassures me that if there was, we would be ready.",
    "failureText": "A few minutes later and you see a bleary-eyed Darth stumbling out onto the castle battery still in their night clothes. You summon them to the command room and they take their time getting there. They look terrified. \"What's going on?!\" They shout over the alarms which you begin to disengage. \"Nothing but another disappointment,\" you reply.",
    "previousMission": "None",
    "previousMissionResultNeeded": "None"
  },
  {
    "missionName": "Ogre Battle",
    "location": "Hymth II",
    "minAge": 12,
    "maxAge": 17,
    "description": "Darth has taken to their ogre, whom they've named Ogie, rather too seriously. You decide to put that relationship to the test and send the pair to Hymth II. If they can bring you the head of another ogre, Ogie shall be allowed to live.",
    "passReqs": "Loyalty - 50\nBadAttribute -  Kind",
    "succeed": "Confidence 3\nSkill 5",
    "fail": "Confidence -4\nLoyalty -5\nAddAttribute Depressed",
    "successText": "A few days later you wake to the smell of blood and something more...fetid. Darth sits astride Ogie on the opposite side of your chambers, three severed ogre heads lay at the creature's feet. Their bond is impressive. Perhaps the monster shall be allowed to live yet.",
    "failureText": "The pair return empty-handed. You suspect Darth's kindness had something to do with their inability to sick the ogre on another of its kind, but you don't ask. Instead you simply slaughter the beast and watch as hatred surges through your apprentice.",
    "previousMission": "Phone a Fiend",
    "previousMissionResultNeeded": "Success"
  },
  {
    "missionName": "Nightmares",
    "location": "The Castle",
    "minAge": 12,
    "maxAge": 17,
    "description": "Darth comes to you one morning with dark circles neath each eye. When pressed, they tell you they've been having nightmares. Horrible images of that...thing Darth attempted to summon have been haunting them. Perhaps this is a chance for you to bond with your fragile apprentice.",
    "passReqs": "Loyalty - 60\nBadAttribute - Neurotic",
    "succeed": "Loyalty 8\nConfidence 3",
    "fail": "Loyalty -7\nConfidence -3",
    "successText": "It's a difficult conversation but you manage to get through to your apprentice. Darth comes to understand that such mistakes are a part of learning. Perhaps another summoning attempt would put the nightmares to rest for good...",
    "failureText": "The depths of Darth neuroses are deeper than you realized. Nothing you say to make them feel better seems to get through and you get the sense that talking about it more won't help any",
    "previousMission": "Phone a Fiend",
    "previousMissionResultNeeded": "Failure"
  },
  {
    "missionName": "A Door to Somewhere",
    "location": "The Castle",
    "minAge": 12,
    "maxAge": 17,
    "description": "Darth asks you one evening about a door in the castle's sublevel. You know the door leads to another random point on the planet each time it is opened, and that it is locked with a spell. You tell them to ignore it. You doubt they will.",
    "passReqs": "Confidence - 13\nLoyalty - 75",
    "succeed": "AddAttribute Curious\nLoyalty 4",
    "fail": "Power -5\nSubAttribute Pensive",
    "successText": "A few days later Darth arrives at  the castle in  a ship you don't  recognize. And weren't they  training in the castle's basement? When they enter the castle they tell you they managed to open the door and went through, when they realized where they were, they stole a passing ship and came home.",
    "failureText": "A peaceful afternoon is interrupted a few days later by a loud explosion that came from the  basement. When you venture down to investigate you find Darth covered in an glittering  black  powder.  They seem to have used a vacuum potion on the door to no  effect. A waste of a valuable potion.",
    "previousMission": "None",
    "previousMissionResultNeeded": "None"
  },
  {
    "missionName": "Consequences",
    "location": "Mid-Rim Waystation",
    "minAge": 12,
    "maxAge": 17,
    "description": "Darth's pursuit of the violent thief on the way to Talacan has apparently resulted in a bounty being placed on their head. At a deserted waystation a mysterious ship lands a ways off, and a plume off dust rises as its owners approach on speederback. Bounty hunters. Leave Darth to fend for themself, surely this will be no contest...",
    "passReqs": "Power - 21",
    "succeed": "Skill 5\nConfidence 2\nAddAttribute Freaky",
    "fail": "Skill -5",
    "successText": "Your apprentice dispatches with the brigands easily, and brings one of their helmets back to your ship as a gift. A tacky blue substance is splattered on one half of it. Yardosian blood. Macabre, but the helm is fine indeed.",
    "failureText": "After a few moments you see Darth round the corner of the sation in a hurry, behind them appear a band of Yardosian bounty hunters. Darth seems to be making for the ship without attempting to fight them. \"Another disappointment,\" you think as you vaporize the assailants with the ship's cannons.",
    "previousMission": "Blood on the Path to Talacan",
    "previousMissionResultNeeded": "Failure"
  },
  {
    "missionName": "Taming the Crew",
    "location": "Orbit of Yardoso Prime",
    "minAge": 16,
    "maxAge": 100,
    "description": "The Ruler of Yardoso Prime has contacted you. He is in need of discrete justice and understands you have a way with such things. The crew of a defensive battle station orbiting the planet has gone rogue, and are threatening to decimate the capital city and its environs if they are not paid handsomely. Send your apprentice, and they will take care of the matter.",
    "passReqs": "Skill - 40\nConfidence 50",
    "succeed": "Confidence 10",
    "fail": "Confidence -7\nAddAttribute Guilty",
    "successText": "Several weeks have passed since Darth left for Yardoso. A scouting bot you sent to the area now reports that the space station has disappeared entirely. In the same moment a shadow passes over your window and you see the station floating outside. Your apprentice has indeed secured the station, and returned with it as a gift.",
    "failureText": "Not long after you dispatch Darth you receive an irate message from Lord Emran: The crew of the battle station is indeed dead, but so are the people upon which it crashed. He will not be contacting you again.",
    "previousMission": "None",
    "previousMissionResultNeeded": "None"
  },
  {
    "missionName": "A Senator in Your Sights",
    "location": "Tanscoruc System",
    "minAge": 18,
    "maxAge": 100,
    "description": "Legislation has reached the Imperial Senate that would impose much stricter punishment for the unsanctioned use of space magics. Another petty attempt by the unskilled to attack those they envy. Darth is of the age where they might prove useful in such a situation. Perhaps they can have a word with the senator behind the bill and see to it that they change their mind. Discretion, and preserving the life of the senator, however, is paramount.",
    "passReqs": "Skill - 50",
    "succeed": "Power 5\nSkill 5",
    "fail": "Confidence -2\nPower -3",
    "successText": "With the utmost confidence you brief Darth on the situation and they absorb every last detail of the plan. They take off in their shuttle the following morning and are in Tanscoruc by loop's end. When next you hear from them they say only to watch the Imperial feed. Indeed when you turn to it, the senator, looking only a little shaken, is walking back theri prior arguments after doing some \"soul searching\" and has come to understand that such sanctions would only press the magics they wish to regulate further still from their view.",
    "failureText": "Your confidence is middling but you brief Darth on the situation anyway. Perhaps they'll surprise you. They do not. You do not hear from them for several days after leaving for the Imperial capital, but you see their deeds well before. A senator dead, and half a dozen guards are gone with them. You consider it lucky that investigators were unable to detect the use of magic. However even without its champion, the bill passes anyway. When Darth eventually returns, you do not speak to them.",
    "previousMission": "None",
    "previousMissionResultNeeded": "None"
  },
  {
    "missionName": "Rule of One",
    "location": "Mid-Rim",
    "minAge": 18,
    "maxAge": 100,
    "description": "There was a time when various factions of magic users could abide one-another, but that time has passed. When you discover the Hymthions have begun practicing light-bending, it's all you can do to conceal your rage. Send Darth to put down this ramshackle band of fools. Show them exactly what magic can do.",
    "passReqs": "Loyalty - 50\nPower - 50",
    "succeed": "Power 5",
    "fail": "Power -5",
    "successText": "Darth reaches the enclave on Hymth Prime and wastes no time in laying it to waste. When they return they describe the feeble attempts of the Hymthions to fight back with their stolen magic. The rage Darth felt allowed them to reach new heights, and they thank you for the opportunity to practice their craft.",
    "failureText": "What should have been an easy enough task leaves Darth bloodied, scorched, and bruised. While they claim the Hymthonians were more advanced than your intelligence believed, they are proven wrong when you later visit the settlement yourself. The enclave on Hymth Prime is pitiful and you bring it to heel with ease. You being to wonder if Darth showed them pity and notice the taste of bile rise in your throat.",
    "previousMission": "None",
    "previousMissionResultNeeded": "None"
  },
  {
    "missionName": "Of Rats and Pirates",
    "location": "Fendrang Kingdom",
    "minAge": 18,
    "maxAge": 100,
    "description": "Lady Fendrang contacts you requesting your \"services\". A band of pirates has begun interrupting trade to her kingdom. Worse still they've proven resilient against her own forces, somehow able to anticipate her every move. A more perfect task for an apprentice one could not ask.",
    "passReqs": "Skill - 30\nPower - 30",
    "succeed": "Loyalty 3\nSkill 3",
    "fail": "Confidence -3\nSkill - 3",
    "successText": "Darth lives up to the reputation you've curried in the Fendgrand Kingdom. Within a loop they are able to not only destroy the pirates, but deliver the traitor leaking information to rapscallions to the Lady herself. She is quite pleased, and rewards you handsomely.",
    "failureText": "It was such a simple task and yet Darth managed to fumble it in spectacular fashion. While they were able to find the pirates, they imploaded the wrong ship. Instead of crippling the pirate fleet, they've managed to destroy a Fendrang cruiser and ruin your relationship with the Lady.",
    "previousMission": "None",
    "previousMissionResultNeeded": "None"
  },
  {
    "missionName": "Coup d'Rot",
    "location": "Castle System",
    "minAge": 18,
    "maxAge": 100,
    "description": "There's a small planet not far from the castle that's recently been settled by farmers. The local rulers there are doing quite well for themselves, but they do not pay tithes to their powerful neighbor. Whether they know of said neighbor is beside the point. Darth should have a word.",
    "passReqs": "Loyalty - 40\nPower - 35",
    "succeed": "Loyalty 5",
    "fail": "Loyalty -3\nPower 5",
    "successText": "Before you know it the castle is inundated with offerings and the rulers of this small rock are square within your pocket. They will most certainly prove useful someday soon. How Darth managed to accomplish this so quickly you do not know, and do not deign to ask.",
    "failureText": "It could have been a fruitful relationship, you're sure of it, but Darth was less than subtle in their \"discussions\" with the locals. Indeed you begin to wonder if they even uttered a word before slaughtering the lot of them. The planet becomes a desolate rock once again.",
    "previousMission": "None",
    "previousMissionResultNeeded": "None"
  },
  {
    "missionName": "Boy in a Bag",
    "location": "Mid-Rim",
    "minAge": 18,
    "maxAge": 100,
    "description": "The smith who forges your hyper-cauldrons has recently grown a conscious and is refusing to do business with you because of your \"vile and tainted magics of evil\". Dispatch Darth to kidnap the man's son and see if his opinion changes.",
    "passReqs": "Skill - 45\nBadAttribute Aggressive",
    "succeed": "Skill 3\nConfidence 3\nLoyalty 2",
    "fail": "Confidence -2",
    "successText": "The boy is delivered to you summarily. Darth tells you that the smithy was willing to do business even before Darth took the child, but felt the message was better sent if they followed through. How right they were. You don't pay for another hyper-cauldron as long as the smithy can swing a hammer.",
    "failureText": "With a sigh you concede such a delicate task did perhaps require a more level head than Darth yet possesses. Still, it's a shame the galaxy should lose such a talented smithy and his only progeny. Darth was able to bring a few cauldrons back, but alas, they're all the wrong size.",
    "previousMission": "None",
    "previousMissionResultNeeded": "None"
  },
  {
    "missionName": "Corandis Cornered",
    "location": "Outer Rim",
    "minAge": 18,
    "maxAge": 100,
    "description": "Corandis flows readily through much of the outer rim. There was a time when you would never consider dealing with the petty tyrants that peddle the stuff. However, as news of the ludicrous revenue the drug generates passes your deck, you think perhaps now might be the time to get involved in the game. Darth has been asking for a pet project, and this should entertain them thoroughly.",
    "passReqs": "Skill - 30\nPower - 40",
    "succeed": "Confidence 5\nPower 4",
    "fail": "Power -5",
    "successText": "Darth is almost too capable operating in the underworld of the outer rim. Within a fortnight they dismantle the operations of several smaller smugglers. Out of the urchins that crawl from under the toppled bosses Darth forms a smuggling syndicate of their own and begins to rival the other corandis barrons that remain at large.",
    "failureText": "You're glad you installed a cloaking device for the entire castle, but you never thought you'd have to <i>use</i> it. However when Darth comes hurtling back to the planet with a fleet of angry smugglers behind them you put the device to good use. You wish you could say you're surprised with the outcome, but honestly the only thing surprising about the situation is that Darth is still breathing at all.",
    "previousMission": "None",
    "previousMissionResultNeeded": "None"
  },
  {
    "missionName": "Making Moves",
    "location": "Outer Rim",
    "minAge": 18,
    "maxAge": 100,
    "description": "As a major player in the corandis smuggling market, Darth is in a little over their head. They ask what should be done about the remaining barons. Should they cut a deal, or cut their throats? You wish to push Darth further, and suggest they take the latter option.",
    "passReqs": "Confidence - 20",
    "succeed": "AddAttribute Determined\nSkill 3",
    "fail": "Skill -5\nSubAttribute Happy",
    "successText": "Darth takes your advice to heart and makes moves on each of the other barons in quick succession. They fall one after the next to Darth's blistering power. Your apprentice now rules the corandis trade in its entirety and the money pours in.",
    "failureText": "Darth ignores your advice and tries to cut a deal with the other barrons. They agree, then backstab Darth at the next opportunity, wiping out his syndicate just as quickly as it was built.",
    "previousMission": "Corandis Cornered",
    "previousMissionResultNeeded": "Success"
  },
  {
    "missionName": "Crossfire",
    "location": "Castle Orbit",
    "minAge": 18,
    "maxAge": 100,
    "description": "While the cloaking device works for a time, Darth's attempts at busting in on the corandis smuggling world leave a mark. The castle comes under assault yet again as several syndicates bear down on it en masse. The castle has plenty of defense systems, but you decide to send darth into orbit in an attempt to turn the crime lords against one another...",
    "passReqs": "Power - 20\nSkill - 15",
    "succeed": "Power 4",
    "fail": "Power -4",
    "successText": "Against all odds, Darth managers to drawn the fire of the corandis barrons' ships, causing them to fire on one another inadvertently. The resulting fracas leads to further infighting, and before long the lot of them are either jumping back into hyperspace before their engines fail or laying in ruin floating in orbit.",
    "failureText": "Things go about as well as you could expect. Darth is shot down almost immediately and you send a drone out to rescue them. As for the barrons, well, one blast from the castle's hyper-light cannon is enough to send the surviving frigates running.",
    "previousMission": "Corandis Cornered",
    "previousMissionResultNeeded": "Failure"
  }
]
}